package com.javalec.base;

public class Main {

	public static void main(String[] args) {
		
		// 은행 업무 볼 수 있는 UI 만들기
		// 1. 예금 (고객 번호 이용해서)
		// 2. 출금 (고객 번호 이용해서)
		// 3. 통장 만들기 (고객 번호 주기)
		// 4. 고객의 현재 통장 상황은 어떠한가 (고객 번호 이용해서)
		// 5. 내가 입출금한 내역 보기 (고객 번호를 주면 ) 
		
		/*
		 * 콘솔에 어떻게 보이게 만들 것인가?
		 *  고객번호 입력하세요 
		 *  없을 시 통장만들기로
		 *  있으면  
		 *  1. 예금 
		 *  2. 출금
		 *  3. 내 지금 통장 상황
		 *  4. 입출금 내역 보기 
		 *  5. 종료
		 *  >> 업무 번호 고르세요 : 
		 *  1번 일시 
		 *  예금 할 금액 : 
		 *  총액 :
		 *  
		 *  2번 일시 
		 *  출금할 금액 : 
		 *  만약 출금할 금액이 현재 있는 금액보다 많으면 오류 출력하기
		 *  아니라면 총액 : 
		 *  
		 *  3번 일시
		 *  총액 : 
		 *  
		 *  4번 일시
		 *  로그 쭈우우우욱 보여주기
		 *  
		 *  5번 일시 
		 *  종료
		 */

	}

}
